cases/Chapter_5/Paredes_3D/free/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../myVars" //Include global variables

scale   1;

vertices        
(
    ( $x1 $y1 $z1 ) //0
    ( $x2 $y1 $z1 ) //1
    ( $x1 $y2 $z1 ) //2
    ( $x2 $y2 $z1 ) //3
    ( $x1 $y1 $z2 ) //4
    ( $x2 $y1 $z2 ) //5
    ( $x1 $y2 $z2 ) //6
    ( $x2 $y2 $z2 ) //7                   
);

size_0  #calc "$cyl_R/1.5"; // Element size to use for refinement level zero
N_x     #calc "round(fabs($x2-($x1))/$size_0)"; 
N_y     #calc "round(fabs($y2-($y1))/$size_0)";
N_z     #calc "round(fabs($z2-($z1))/$size_0)";

blocks
(   
    hex (0 1 3 2 4 5 7 6) ( $N_x $N_y $N_z )
    //simpleGrading (1 1 1)
    simpleGrading
    (
        (
            (#calc "$relaxation_length/$domain_length" 0.2 0.5)  // % x-dir, 20% cells, expansion 1/2
            (#calc "$tank_length/$domain_length" 0.6 1) // % x-dir, 60% cells, expansion     
            (#calc "$relaxation_length/$domain_length" 0.2 2) // % x-dir, 20% cells, expansion 2
        )
        1   // y-direction expansion ratio
        1   // z-direction expansion ratio
    )
);

patches         
(
    patch inlet
    (
        (0 4 6 2)
    )

    patch outlet
    (
        (1 5 7 3)
    )

    patch bottom
    (
        (0 1 3 2)
    )

    patch atmosphere
    (
        (4 5 7 6)
    )

    wall back 
    (
        (0 1 5 4)
    )

    patch front 
    (
        (2 3 7 6)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
