cases/Chapter_5/Paredes_3D/free/constant/waveProperties.input
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      environmentalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//User-defined parameters
#include "../myVars" //Include global variables

// Start wavesProperties.input
seaLevel	0;
//seaLevelAsReference true;

// A list of the relaxation zones in the simulation. The parameters are given
// in <name>Coeffs below.
relaxationNames (inlet outlet);

initializationName inlet;

inletCoeffs
{
    waveType    potentialCurrent; // Current which is uniform over the depth
    U           (0 0 0);
    Tsoft       0.1;

    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;    

        relaxType   INLET;
        startX      ($x1 0 $z1);
        endX        (#calc "$x1+$relaxation_length" 0 $z2);
        orientation      (1.0 0.0 0.0);
    }
};

outletCoeffs
{
    waveType    potentialCurrent; // Current which is uniform over the depth
    U           (0 0 0);
    Tsoft       0.1;

    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Rectangular;
        beachType        Empty;    

        relaxType   OUTLET;
        startX      (#calc "$x2-$relaxation_length" 0 $z1);
        endX        ($x2 0 $z2);
        orientation      (1.0 0.0 0.0);
    }
};

// ************************************************************************* //
