cases/Chapter_5/Paredes_3D/free/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../myVars" //Include global variables
// This file is used to overwrite values at selected cells
defaultFieldValues
(
    volScalarFieldValue alpha.water 0 //no water
);

regions
(
    boxToCell // select all cells whose cell centre inside given bounding box
    {
        box ($x1 $y1 $z1) ($x2 $y2 0); // box (xmin ymin zmin) (xmax ymax zmax)
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
);

// ************************************************************************* //
